# Hierarchical Indexing

In [1]:
import numpy as np
import pandas as pd

In [2]:
# Create a Series with a list of lists (or arrays) as the index:
index = [['a','a','a','b','b','b','c','c','d','d'], # level 1 index
         [1,2,3,1,2,3,1,2,1,2]]                     # level 2 index
ser = pd.Series(np.random.randn(10),index = index)
ser

a  1   -1.696802
   2    1.486175
   3    0.331155
b  1    0.432228
   2   -0.619924
   3   -0.577801
c  1   -1.630014
   2    0.325688
d  1   -0.529471
   2   -0.719908
dtype: float64

In [3]:
# Data retrieval  
ser['a']

1   -1.696802
2    1.486175
3    0.331155
dtype: float64

In [4]:
# single value
ser['a'][2]

1.4861746486272491

In [6]:
df = pd.DataFrame(np.arange(12).reshape((4, 3)),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]], 
                  columns=['AB', 'ON', 'BC'])
df

     AB  ON  BC
a 1   0   1   2
  2   3   4   5
b 1   6   7   8
  2   9  10  11

In [7]:
df['AB']

a  1    0
   2    3
b  1    6
   2    9
Name: AB, dtype: int32

In [10]:
df.loc['a']

   AB  ON  BC
1   0   1   2
2   3   4   5

In [16]:
df

     AB  ON  BC
a 1   0   1   2
  2   3   4   5
b 1   6   7   8
  2   9  10  11

In [17]:
#df.loc['b']
#df.loc['b'].loc[2]
df.loc['b'].loc[2]['BC']

11

In [18]:
df.index.names

FrozenList([None, None])

In [19]:
df.index.names = ['L_1', 'L_2']
df

         AB  ON  BC
L_1 L_2
a   1     0   1   2
    2     3   4   5
b   1     6   7   8
    2     9  10  11